### 4.1: Create a dictionary that has 3 keys: name, age and salary, and enter in the following dummy information.

#### Sample output
> {'name': 'Tim Cook', 'age': 59, 'salary': 3000000.0}

In [1]:
dict = {'name': 'Tim Cook', 'age':59, 'salary':3000000.0}
dict

{'name': 'Tim Cook', 'age': 59, 'salary': 3000000.0}

### 4.2: Create a second dictionary, this time with at least 5 different names, ages, and salaries.

*Hint: There should only be three keys, and the values should be a list.*

#### Sample Output

> {'name': ['Tim Cook', 'Person 2', 'Person 3'],
> 'age': [59, 24, 40],
> 'salary': [30000000.0, 200000.0, 900000.0]}

In [2]:
dict2 = {'name': ['Tim Cook', 'Person 2', 'Person 3'],'age': [59, 24, 40],'salary': [30000000.0, 200000.0, 900000.0]}
dict2

{'name': ['Tim Cook', 'Person 2', 'Person 3'],
 'age': [59, 24, 40],
 'salary': [30000000.0, 200000.0, 900000.0]}

### 4.3: Create a pandas dataframe using the dictionary you created above

**Hint: Use the `pd.DataFrame.from_dict()` method**

#### Sample output
![](images/df.png)

In [3]:
import pandas as pd
df = pd.DataFrame.from_dict(dict2)
df

       name  age      salary
0  Tim Cook   59  30000000.0
1  Person 2   24    200000.0
2  Person 3   40    900000.0

### 4.4: Rename all three columns of the dataframe

*Hint: you should use the pandas function [rename()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html) to accomplish this. You can rename it to whatever you like, just show us you are able to use this function*

In [6]:
df.rename(columns={"name":"NAME", "age":"AGE", "salary":"SALARY"})

       NAME  AGE      SALARY
0  Tim Cook   59  30000000.0
1  Person 2   24    200000.0
2  Person 3   40    900000.0

In [7]:
df.rename(str.lower, axis = 'columns')

       name  age      salary
0  Tim Cook   59  30000000.0
1  Person 2   24    200000.0
2  Person 3   40    900000.0